from pydub import AudioSegment
from moviepy import VideoFileClip, AudioFileClip
import os


# def speed_up_audio_to_match_video(audio_path: str, video_path: str, output_path: str = "speedup_audio.wav"):
#     audio = AudioSegment.from_wav(audio_path)
#     video_duration_sec = VideoFileClip(video_path).duration
#     original_duration_sec = len(audio) / 1000

#     # Calculate speed factor
#     speed_factor = original_duration_sec / video_duration_sec
#     if speed_factor <= 1.0:
#         print("No need to speed up, audio fits within video.")
#         audio.export(output_path, format="wav")
#         return

#     print(f"Speeding up audio by factor of {speed_factor:.2f}")

#     # Use ffmpeg filter for time compression
#     import subprocess
#     subprocess.call([
#         "ffmpeg", "-y",
#         "-i", audio_path,
#         "-filter:a", f"atempo={speed_factor:.5f}",
#         output_path
#     ])

# speed_up_audio_to_match_video(audio_path="./final_output.wav", video_path="./video_sample/vaatisyg.mp4")

# ---------------------------------------------------------------------------------------------------------------------------------------

# def merge_audio_chunks_with_timestamps(translated_chunk, chunk_folder: str = "tts_outputs", output_path: str = "zfinal_output.wav"):
#     final_audio = AudioSegment.empty()

#     for i, chunk in enumerate(translated_chunk):

#         # Load the chunk audio
#         chunk_path = os.path.join(chunk_folder, f"chunk_{i}.wav")
#         chunk_audio = AudioSegment.from_wav(chunk_path)

#         # Append to final audio
#         final_audio += chunk_audio

#     # Export the final merged audio
#     final_audio.export(output_path, format="wav")
#     print(f"Final audio saved to: {output_path}")

# chunk = [{'timestamp': (0.0, 2.0), 'text': 'दो नाइट्स, एक सोल'}, {'timestamp': (2.0, 5.0), 'text': 'सिएगमeyer और सिएगवर्ड ऑफ़ कैटारिना\n'}, {'timestamp': (6.0, 10.0), 'text': '"दांस ऑफ डार्कनेस के नाइट अपने गृहस्थों के प्रतीक के रूप में खड़े हैं।"\n'}, {'timestamp': (10.0, 16.0), 'text': 'उदाहरण के लिए, ऑस्कर और सोलेयर से, हम अस्टोरा का वीर विनाश महसूस करते हैं।'}, {'timestamp': (16.0, 21.0), 'text': 'ओswald और Lautrec, करीम के भयानक पंथों से।'}, {'timestamp': (21.0, 25.0), 'text': '"Petrus को देखकर थोरोलंड की विडंबना को देखो।"'}, {'timestamp': (25.0, 29.0), 'text': 'या या लोथ्रिक नाइटस को उनके आत्म-त्याग के उद्देश्य के लिए भी।'}, {'timestamp': (29.0, 35.0), 'text': 'लेकिन अगर मैं आपसे कहती हूँ कि कैटेरीना को कल्पना करें, तो आपको उस जगह के बारे में मधुर भावना रखनी चाहिए।\n'}, {'timestamp': (35.0, 41.26), 'text': 'कैटरीना एक शराब और उत्सव का देश है, और इसकी रातें खुशहाल और साहसी हैं।'}, {'timestamp': (41.26, 47.16), 'text': 'जैसे अपने आसपास के साथियों की तरह, कैटरीना निश्चित रूप से अनडेड शाप से पीड़ित है, जो पीड़ितों को बर्बाद कर देता है।'}, {'timestamp': (47.16, 50.22), 'text': 'अनंत जीवन और एक खोखले भाग्य की ओर।\n'}, {'timestamp': (50.22, 55.28), 'text': 'लेकिन इसके सभी भयानक होने के बावजूद, अजीवित कुछ अवसर प्रदान करता है।'}, {'timestamp': (55.28, 61.0), 'text': 'कुछ लोग प्राचीन कलाओं को तलाशने के लिए प्रेरित होते हैं या बेतुके जुनूनों में लिप्त होते हैं।'}, {'timestamp': (61.0, 68.0), 'text': 'यह अब अतार्किक नहीं है यह सोचना कि आप देवताओं के देश तक पहुँच सकते हैं या प्राचीन भविष्यवाणी को ट्रिगर कर सकते हैं।'}, {'timestamp': (68.0, 76.0), 'text': 'तुम्हारे नैतिक मूल्य अनंत काल के सामने चुनौती का सामना करते हैं और यह संभव है कि प्राचीन देवताओं ने खुद तुम्हें इस भाग्य को दिया हो।'}, {'timestamp': (76.0, 80.0), 'text': 'लेकिन ज़िएग्मेयर के लिए, उसका अभिशाप एक सरल चीज़ का मतलब था।'}, {'timestamp': (80.0, 81.0), 'text': 'साहस।\n'}, {'timestamp': (81.0, 86.0), 'text': 'और एक-एक करके, वे सभी मांस की सीमाओं और इच्छा की सीमाओं को सीखते हैं।'}, {'timestamp': (86.0, 92.76), 'text': 'और जबकि उन सभी का अंत में कुछ भी नहीं बचा, उनकी कहानियाँ बची रहीं।'}, {'timestamp': (98.5, 99.08), 'text': 'मरने के बाद जीवित रहना का मतलब है खुद को खोना, और जो कोई भी सब कुछ खो देता है, वह खाली हो जाता है।'}, {'timestamp': (105.6, 106.06), 'text': 'दुर्लभ है लॉर्डरैन में एक मानव को देखने का अवसर, क्योंकि सियाग्लिंड के पास केवल एक जीवन खोने के लिए है।'}, {'timestamp': (110.24, 116.96), 'text': 'इन सबके बावजूद, वह यहाँ आने के लिए दुनिया के बीच से आधे रास्ते तक यात्रा करती है, और साथ ही लॉर्डरान की लंबाई भी पार कर लेती है, जिससे वह वास्तव में प्रेरणादायक है।'}, {'timestamp': (116.96, 122.62), 'text': 'ओह, क्या तुमने मेरी पिताजी को देखा है? तुम्हें उन्हें याद नहीं आएगा। मेरे जैसे ही एक कवच जैसा।'}, {'timestamp': (123.04, 127.0), 'text': '"शुक्रिया। मुझे पता था कि वह कहीं न कहीं था। तो अब, मुझे उसकी कमी महसूस हो रही है। मेरे जैसे ही एक कवच का ढांचा। शुक्रियों की बात है। मुझे पता था कि वह कहीं न कहीं था।"'}, {'timestamp': (127.0, 131.0), 'text': 'तो ठीक है, अब मुझे उसे ढूंढना ही होगा। सचमुच, फिर भी धन्यवाद।'}, {'timestamp': (131.0, 135.0), 'text': 'अब मैं बस यहीं रहूँगा और किसी परेशानी में नहीं पड़ूँगा।'}, {'timestamp': (135.0, 142.78), 'text': 'वह सिग्मेयर ने पीछे छोड़ दिया उस जीवन का एक छोटा सा हिस्सा है, लेकिन एक मृत व्यक्ति की यादें तेजी से धुंधली हो जाती हैं, सबसे पुरानी सबसे पहले फीकी पड़ जाती हैं।'}, {'timestamp': (142.78, 148.72), 'text': 'मेरी बेटी जान और माल दोनों को खतरे में डालकर मुझे ढूंढने आई, ताकि अपनी माँ की अंतिम बातें सुना सके।'}, {'timestamp': (148.72, 151.76), 'text': 'और गरीब लड़की तो मृत भी नहीं है।\n'}, {'timestamp': (151.76, 156.4), 'text': 'हे भगवान। मैंने उससे ऐसा करने के लिए कभी नहीं कहा।'}, {'timestamp': (156.4, 162.0), 'text': 'उन्होंने यहाँ रोमांच की तलाश में आया था, और यह वास्तव में एक बहुत ही शुद्ध प्रेरणा है, सचमुच दूसरों की तुलना में।'}, {'timestamp': (162.0, 168.0), 'text': 'वह पकड़, उन लोगों को लॉर्डरन में। उसकी प्रगति और तलाश करने की क्षमता उसे…\n'}, {'timestamp': (168.0, 174.0), 'text': 'हॉलोइंग, बस इतना ही महत्वपूर्ण है कि बाधाओं को पार किया जा सके और रोमांच का अनुभव हो। हालाँकि...'}, {'timestamp': (174.0, 178.0), 'text': '"...मैं सीधा एक दीवार पर चढ़ गया, या एक गेट, मुझे लगता है।"'}, {'timestamp': (178.0, 182.0), 'text': 'यह चीज़ बस नहीं हँसती, चाहे मैं कितना भी देर तक इंतज़ार करूँ।'}, {'timestamp': (182.0, 185.0), 'text': 'और ओह, मैंने कितनी देर तक इंतज़ार किया है।\n'}, {'timestamp': (185.0, 190.0), 'text': 'उम्, मेरे शूरवीरता के नाम पर मुझे शर्म आती है, लेकिन क्या आप कुछ थोड़ी सी लो葉 की टहनियाँ दे सकते हैं?'}, {'timestamp': (190.0, 196.0), 'text': 'यह एक काफी ठीक है। हमें अभी और तीन... नहीं, शायद पांच शरीर चाहिए।'}, {'timestamp': (196.0, 199.0), 'text': 'हम्म, वाकई में बहुत बड़ी मरम्मत है।'}, {'timestamp': (199.0, 204.0), 'text': 'सिएग्मेयर नाम का अर्थ है विजय, और यही आप उससे ले सकते हैं।'}, {'timestamp': (204.0, 208.0), 'text': 'दरवाजे, पुराना किला, क्या ये आपकी वजह से था?'}, {'timestamp': (208.0, 212.0), 'text': 'लेकिन चेतावनी दी जाती है, वीरता में बड़ी खतरे शामिल हैं।'}, {'timestamp': (212.0, 216.0), 'text': 'अगला बार, मुझे एक योजना बनाने का मौका दो।\n'}, {'timestamp': (216.0, 220.0), 'text': 'अच्छा, तो क्या ऐसा लगता है जैसे हमारी नियति आपस में जुड़ी हुई है, है न?'}, {'timestamp': (220.0, 224.0), 'text': 'शायद यह भी भगवान ग्विन का अपना ही फैसला है।'}, {'timestamp': (224.0, 231.44), 'text': 'जैसे आप सिग्मीयर को बचाते हैं, आप शायद उसकी खुद में विश्वास कम कर रहे होते हैं, जिससे वह एक अंतिम स्टैंड लेने के लिए प्रेरित होता है।'}, {'timestamp': (231.66, 233.9), 'text': 'क्या वो राक्षस तुम्हें जीवन में मुश्किल बना रहे हैं?'}, {'timestamp': (234.08, 235.34), 'text': 'आपको शर्म करने की ज़रूरत नहीं है।\n'}, {'timestamp': (235.64, 237.52), 'text': 'हम सब एक ही नाव में हैं, तुम जानती हो।\n'}, {'timestamp': (238.36, 240.36), 'text': 'मैं सचमुच में आपको बहुत कर्ज में डाल दिया है।'}, {'timestamp': (240.6, 243.26), 'text': 'शायद समय आ गया है।\n'}, {'timestamp': (243.92, 246.18), 'text': 'यह उसके दोस्त का कर्ज चुकाने का एक आत्महत्या का मिशन है।'}, {'timestamp': (246.56, 249.4), 'text': 'लेकिन तुम उस जीत को भी उससे ले लो।\n'}, {'timestamp': (249.74, 251.22), 'text': 'और अब मैं जा रहा हूँ।\n'}, {'timestamp': (251.98, 252.86), 'text': 'न धीमे हो।\n'}, {'timestamp': (256.82, 258.14), 'text': 'આવજો!\n'}, {'timestamp': (258.46, 278.7), 'text': 'यहां, तुम शैतान! घबराओ! howl प्राणी! मैं ज़िगमंट हूँ! रrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr'}, {'timestamp': (278.7, 282.28), 'text': 'यहाँ उसके जीवित रहने का एक रास्ता है अगर आप फिर से उसके जीवन को बचाते हैं।'}, {'timestamp': (283.28, 291.92), 'text': "लेकिन तुम, क्या तुम भाग गए? ठीक है, तुमने फिर से मुझे बचा लिया। ओह, शुक्र है। मैं'…"}, {'timestamp': (291.92, 292.38), 'text': 'थका हुआ।\n'}, {'timestamp': (292.94, 297.0), 'text': 'तो यह सिगमायर को जीवित देखने आखरी बार होगा।'}, {'timestamp': (297.0, 305.0), 'text': 'मेरे पिता, उन्होंने अपना अंतिम साहसिक कार्य किया। चिंता मत करो। यह बस इतना ही है कि वे ऐसे ही हैं। जीवित या नहीं।'}, {'timestamp': (305.0, 312.0), 'text': 'यह सचमुच में थोड़ा सुकून देने वाला है। अगर वो खाली हो जाता है, तो मुझे बस फिर से उसे मारना होगा।'}, {'timestamp': (312.0, 318.6), 'text': 'सीग्लिइंड का नाम का अर्थ है "शांतिपूर्ण युद्ध की"। यहाँ वह बस मज़ाक कर रही है कि वह हमेशा...\n'}, {'timestamp': (318.6, 325.5), 'text': 'वहाँ उसे शांत करने के लिए, भले ही सबसे बुरा हो। और यह एक खराब स्वाद में मजाक है, क्योंकि यह आता है।\n'}, {'timestamp': (325.5, 327.0), 'text': 'अंत में सच है।'}, {'timestamp': (327.0, 329.1), 'text': 'हाँ। अब मैं देखता हूँ।'}, {'timestamp': (329.34, 330.9), 'text': 'तुम एक बुरे लोग हो।\n'}, {'timestamp': (331.12, 333.44), 'text': 'फिर बस एक ही चीज़ करनी है तुमसे।'}, {'timestamp': (334.3, 340.22), 'text': 'ओह, कैसी महान है, प्यारे पिताजी।'}, {'timestamp': (340.82, 344.56), 'text': 'हे भगवान, मेरे प्यारे छोटे आदमी।\n'}, {'timestamp': (346.08, 349.74), 'text': 'और इसलिए, आपके दोस्त सिग्मार अपनी जान वहां राख झील में खो देता है।'}, {'timestamp': (350.32, 352.12), 'text': 'वह अपने मृत पत्नी के साथ जुड़ने जाता है।\n'}, {'timestamp': (352.74, 354.66), 'text': 'और आप कुछ नहीं कर सकते हैं उसे रोकने के लिए।'}, {'timestamp': (355.16, 355.88), 'text': 'मेरी पिता।\n'}, {'timestamp': (357.1, 358.2), 'text': 'सब कुछ खोखला अब।\n'}, {'timestamp': (359.48, 360.64), 'text': 'वह शांत हो रहा है।\n'}, {'timestamp': (364.0, 366.0), 'text': 'वह कोई और परेशानी नहीं डालेगा। यह आखिरकार खत्म हो गया।\n'}, {'timestamp': (366.0, 369.0), 'text': 'ओ पिता।\n'}, {'timestamp': (369.0, 371.0), 'text': 'प्रिय पिताजी।'}, {'timestamp': (379.0, 381.0), 'text': 'निश्चित रूप से, यह खत्म नहीं हुआ।'}, {'timestamp': (382.0, 385.0), 'text': 'अंत में, जब दुनिया लगभग राख में तब्दील हो गई, तो'}, {'timestamp': (385.0, 388.0), 'text': '"अश स्वयं ही इसका उत्तराधिकारी होगा।"\n'}, {'timestamp': (388.0, 394.0), 'text': 'ये अजलित, मृतदेही हैं जिन्होंने आग को जोड़ने का प्रयास किया, लेकिन असफल रहे और उन्हें राख कर दिया गया।'}, {'timestamp': (394.0, 400.34), 'text': 'उन्होंने उठने का आदेश दिया गया है, आखिरी उपाय के तौर पर राख केlords को वापस लाने के लिए।'}, {'timestamp': (400.34, 401.2), 'text': 'उनको अपने सिंहासन पर।\n'}, {'timestamp': (401.94, 408.04), 'text': 'और यह प्रतीत होता है, Siegwood के हollowing के बाद, Sieglin की एक रेखा ने ‘the’ को लिंक करने का प्रयास किया।'}, {'timestamp': (408.04, 408.32), 'text': 'अग्नि।'}, {'timestamp': (408.64, 411.8), 'text': '"Siegwood" का नाम का अर्थ है रक्षक या सुरक्षाकर्ता।'}, {'timestamp': (412.16, 412.54), 'text': 'नहीं!\n'}, {'timestamp': (414.2, 415.24), 'text': 'तुम्हारी प्रतीक्षा करनी चाहिए थी! और उसे सियाग्लिन का अर्थ रक्षक या संरक्षक होता है। नहीं! तुम्हें प्रतीक्षा करनी चाहिए थी!'}, {'timestamp': (417.96, 418.4), 'text': 'और उसमें सिग्लीन का दृढ़ संकल्प है।\n'}, {'timestamp': (420.96, 421.7), 'text': 'हम बिना जलया किए हमें अपने कर्तव्य पहले रखना चाहिए।'}, {'timestamp': (423.7, 424.16), 'text': 'और सिग्मिरे का मनभावन स्वभाव।\n'}, {'timestamp': (427.26, 428.16), 'text': 'लेकिन, फिलहाल, हमें एक बधाई देनी है।'}, {'timestamp': (434.0, 436.0), 'text': 'तुम्हारी वीरता, मेरी तलवार और हमारा साथ मिलकर विजय! सूरज हमेशा चमकता रहे!\n'}, {'timestamp': (440.0, 447.0), 'text': 'इससे पहले कि वह अप्रज्वलित हो गया, सिएगवर्ड ने अकेले योर की दोस्ती हासिल की, जो उसके लोगों से प्यार में नहीं था।'}, {'timestamp': (447.0, 452.0), 'text': 'वह एक विशालकाय था जिसने सब कुछ त्याग दिया, फिर भी उसने उन्हें सभी पर एक ही बार में विनाश ला दिया।'}, {'timestamp': (452.0, 460.0), 'text': 'तो, अपने प्यारे दोस्त, सिग्वर्ड को, उसने एक ऐसा एकमात्र कद्म सरू किया, बदले में एक वादा किया।'}, {'timestamp': (460.0, 465.84), 'text': 'एक दिन मैं आग को जोड़ूंगा, और अगर बहरे मेरा नाम पुकारें, तो मेरे पास वापस आने की ताकत नहीं हो सकती।'}, {'timestamp': (466.26, 468.86), 'text': '"तो मुझे मार डालो अगर मैंने कभी वो वादा तोड़ा।"\n'}, {'timestamp': (469.3, 476.94), 'text': 'शायद योरॉम ने उसे इस भूमिका के महत्व पर ज़ोर दिया, क्योंकि सीगवर्ड ने भी आग को जोड़ने की कोशिश की होगी।'}, {'timestamp': (477.24, 484.62), 'text': 'कैसे और वह अज्ञेय हो सकता था? जैसे सीगलिंड ने अपने पिता के लिए किया था, वैसे ही सिग्वर्ड योरम के लिए करता है।'}, {'timestamp': (484.62, 489.96), 'text': 'ऐसा लगता है कि मैं फिर से आपका ऋणी हूँ।'}, {'timestamp': (489.96, 491.46), 'text': 'मेरी धन्\u200dयवात्\u200dता।\n'}, {'timestamp': (491.46, 494.62), 'text': 'मैं तुम्हारे बिना अपना वादा निभा नहीं पाता।\n'}, {'timestamp': (494.62, 498.82), 'text': 'अब, अंतिम टोस्ट के लिए। टू योर’'}, {'timestamp': (498.82, 500.7), 'text': 'वीरता, और मेरा पुराना'}, {'timestamp': (500.7, 501.54), 'text': 'दोस्त यॉर्म,\n'}, {'timestamp': (502.54, 505.12), 'text': 'दीजिये सूरज हमेशा चमकता रहे!\n'}, {'timestamp': (508.78, 510.54), 'text': 'उसकी ड्यूटी पूरी होने के साथ।'}, {'timestamp': (511.06, 512.84), 'text': 'सीगवर्ड अपने घावों के कारण हार गया।'}, {'timestamp': (513.72, 517.0), 'text': "और सिग्मिरे का वंश गौरव में समाप्त होता है, इन'"}, {'timestamp': (517.0, 520.0), 'text': 'एक युग का रोमांच।\n'}, {'timestamp': (535.0, 542.0), 'text': 'हमकी नई Patreon मर्चेंडाइज है, लेकिन मैं इसके बारे में दूसरे में बात करूंगा। पहले, क्या आप यह विश्वास कर सकते हैं कि मूल Siegmeyer Prepare to Cry 2012 में रिलीज़ हुई थी?'}, {'timestamp': (542.0, 545.0), 'text': 'क्या तुमने जब वो रिलीज़ हुआ था, देखा था? इतनी पुरानी बात है तो?'}, {'timestamp': (545.0, 549.56), 'text': 'तुम्हारेमुळेच मला माझ्या कला कोलाहल कोलाहल में सुधाराने में सफलता मिली है, इसलिए धन्यवाद।'}, {'timestamp': (549.96, 555.38), 'text': 'तब, मैं पैट्रियन के कारण इससे पूरी तरह से ध्यान दे पाने में सक्षम था, और अब मैं चाहता हूँ कि...'}, {'timestamp': (555.38, 561.2), 'text': 'घोषणा करें एक नया Patreon स्तर जो आपको कुछ वापस पाने में मदद करता है। यदि आप कलेक्टर स्तर में शामिल होते हैं, तो फिर...'}, {'timestamp': (561.2, 565.88), 'text': 'आप तीन महीने लगातार सदस्यता लेते हैं, तो यह पोस्टर स्वचालित रूप से आपके पते पर भेजा जाएगा।'}, {'timestamp': (565.88, 566.68), 'text': 'पता। यह एक सुनहरा वाल्किरी का डिज़ाइन है, और यह तीन महीनों तक लगातार प्रेरित है, आप स्वचालित रूप से इस पोस्टर को अपने पते पर प्राप्त करेंगे।'}, {'timestamp': (566.68, 569.12), 'text': 'यह एक सोने के वाल्किरी का डिज़ाइन है।'}, {'timestamp': (569.12, 571.4), 'text': 'और यह कुछ हद तक एल्डन रिंग से प्रेरित है।'}, {'timestamp': (571.4, 573.2), 'text': 'और यह सीबॉट द्वारा डिज़ाइन किया गया है।'}, {'timestamp': (573.2, 576.6), 'text': 'कौन इस चैनल पर सबसे शानदार मर्च बना रहा है?\n'}, {'timestamp': (576.6, 580.24), 'text': 'तो यह एक बहुत, बहुत विशेष उत्पाद है।'}, {'timestamp': (580.24, 585.6), 'text': 'विशेष रूप से यह देखते हुए कि पैट्रियन मुझे इस उत्पाद के लिए न्यूनतम $30 ही सेट करने की अनुमति देता है।'}, {'timestamp': (585.6, 590.44), 'text': 'तो केवल सबसे समर्पित अनुयायी ही इसे और उसे पसंद करेंगे, और यह ठीक है।'}, {'timestamp': (590.44, 596.96), 'text': 'मैं बस आपको यह बताना चाहता था कि यह मौजूद है, और आप सभी को धन्यवाद देना चाहता था, चाहे आप प्रायोजक हों या सिर्फ दर्शक।'}, {'timestamp': (596.96, None), 'text': 'तो धन्यवाद आप देखने के लिए और मैं अगली बार आपको फिर मिलूंगा।'}]
# merge_audio_chunks_with_timestamps(chunk)
# ---------------------------------------------------------------------------------------------------------------- 

# import subprocess

# subprocess.call([
#             'ffmpeg',
#             '-i', './video_sample/pointers.mp4',
#             '-i', './speedup_audio.wav',
#             '-map', '0:v',
#             '-map', '1:a',
#             '-c:v', 'copy',
#             '-shortest',
#             'dubbedVideo.mp4'
#         ])


import sys

print(sys.argv)






 
# ---------------------------------------------------------------------------------------------------------------- 

# def overlay_audio_on_video(original_video_path: str, new_audio_path: str, output_path: str = "dubbed_video.mp4"):
#     """
#     Replace the original audio in a video with a new audio track.
    
#     Args:
#         original_video_path (str): Path to the original video file
#         new_audio_path (str): Path to the new audio file to overlay
#         output_path (str): Path where the dubbed video will be saved
#     """
#     try:
#         # from moviepy.editor import VideoFileClip, AudioFileClip
#         # import os
        
#         print("Loading original video...")
#         video_clip = VideoFileClip(original_video_path)

#         print("Loading new TTS audio...")
#         audio_clip = AudioFileClip(new_audio_path)

#         # Handle duration differences between video and audio
#         if audio_clip.duration > video_clip.duration:
#             print(f"Audio ({audio_clip.duration:.2f}s) is longer than video ({video_clip.duration:.2f}s). Trimming audio...")
#             audio_clip = audio_clip.subclipped(video_clip.duration)
#         elif audio_clip.duration < video_clip.duration:
#             print(f"Audio ({audio_clip.duration:.2f}s) is shorter than video ({video_clip.duration:.2f}s). Adding silence...")
#             from moviepy.audio.AudioClip import AudioClip
#             silence = AudioClip(lambda t: 0, duration=video_clip.duration - audio_clip.duration)
#             audio_clip = audio_clip.set_duration(audio_clip.duration) + silence

#         print("Overlaying audio onto video...")
#         video_with_audio = video_clip.with_audio(audio_clip)

#         print(f"Exporting dubbed video to: {output_path}")
#         video_with_audio.write_videofile(output_path, codec="libx264", audio_codec="aac")
        
#         # Clean up to release file handles
#         video_clip.close()
#         audio_clip.close().
#         video_with_audio.close()
        
#         print("Done ✅")

#     except Exception as e:
#         print(f"Error during overlay: {e}")
#         import traceback
#         traceback.print_exc()